app/controllers/articles_controller.rb

    def create
        @article = Article.new params.require(:article).permit(:title, :description)
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Forward Executive"], ["description", "Healthcare"], ["created_at", "2019-07-10 21:22:20.650330"], ["updated_at", "2019-07-10 21:22:20.650330"]]

    def destroy
        article = Article.find params[:id]
        article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 210], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 210]]

    def update
        if @article.update params.require(:article).permit(:title, :description, :published_at)
---
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "Forward Representative Plus Changes!"], ["updated_at", "2019-07-11 00:35:56.134991"], ["id", 348]]